## Pandas Learn with Kaggle

In [43]:
import pandas as pd
pd.DataFrame({'Yes': [50, 21], 'No': [131, 2]})

   Yes   No
0   50  131
1   21    2

In [5]:
pd.DataFrame({'Bob': ['I liked it. ', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']})

             Bob           Sue
0   I liked it.   Pretty good.
1  It was awful.        Bland.

In [6]:
pd.DataFrame({'Bob': ['I liked it. ', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']}, index=['Product A', 'Product B'])

                     Bob           Sue
Product A   I liked it.   Pretty good.
Product B  It was awful.        Bland.

In [7]:
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
pd.Series([30, 40, 50], index=['2015 Sales','2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    40
2017 Sales    50
Name: Product A, dtype: int64

In [45]:
df = pd.read_csv('salary.csv')
print(df['YearExperience', 'Salary'])
print(df.iloc[0])

KeyError: ('YearExperience', 'Salary')

In [47]:
data = pd.read_csv("salary.csv")
data

   YearsExperience    Salary
0              1.1  938383.0
1              1.3  829383.0
2              2.5  839322.0
3              3.0  839293.0

In [13]:
data.columns

Index(['YearsExperience', ' Salary'], dtype='object')

In [35]:
header = ['Name', 'M1 Score', 'M2 Score']
data = [['Alex', 62, 80],['Brad', 45, 56], ['Joey', 84, 29], ['Farid', 28, 83], ['Ivy', 83,92]]
data = pd.DataFrame(data, columns=header)

In [36]:
data.to_csv('student_pandas.csv', index=False)

In [37]:
data = pd.read_csv('student_pandas.csv')

In [38]:
data

    Name  M1 Score  M2 Score
0   Alex        62        80
1   Brad        45        56
2   Joey        84        29
3  Farid        28        83
4    Ivy        83        92